In [1]:
import pandas as pd

In [2]:
workZone_df = pd.read_csv("data/wzassignmentsfinal.csv")
workZone_df = workZone_df.rename(columns={'Workplace Zone Code': 'WZ11CD'})
workZone_df

,WZ11CD,Supergroup Code,Supergroup Name,Group Code,Group Name
0,E33000001,E,Manufacturing and distribution,E4,"Manufacturing, energy and utilities"
1,E33000002,G,Servants of society,G3,Large scale education
2,E33000003,E,Manufacturing and distribution,E1,Mining and quarrying facilities
3,E33000004,E,Manufacturing and distribution,E1,Mining and quarrying facilities
4,E33000005,G,Servants of society,G1,Public administration and security
...,...,...,...,...,...
60704,W35002706,C,Metro suburbs,C5,Professional home-workers in outer suburbs
60705,W35002707,G,Servants of society,G1,Public administration and security
60706,W35002708,G,Servants of society,G1,Public administration and security
60707,W35002709,C,Metro suburbs,C3,Metro suburban distribution industries
60708,W35002710,C,Metro suburbs,C1,Teachers and carers in metro suburbs

In [3]:
WZ_LA_map = pd.read_csv("data/workZone_LA.csv")
WZ_LA_map

         FID     WZ11CD   MSOA11CD        MSOA11NM    LAD20CD     LAD20NM
0          1  E33000269  E02002484  Hartlepool 002  E06000001  Hartlepool
1          2  E33000270  E02002487  Hartlepool 005  E06000001  Hartlepool
2          3  E33000271  E02002487  Hartlepool 005  E06000001  Hartlepool
3          4  E33000272  E02002487  Hartlepool 005  E06000001  Hartlepool
4          5  E33000273  E02002487  Hartlepool 005  E06000001  Hartlepool
...      ...        ...        ...             ...        ...         ...
53573  53574  W35002389  W02000347     Newport 001  W06000022     Newport
53574  53575  W35002390  W02000347     Newport 001  W06000022     Newport
53575  53576  W35002391  W02000347     Newport 001  W06000022     Newport
53576  53577  W35002392  W02000347     Newport 001  W06000022     Newport
53577  53578  W35002393  W02000348     Newport 002  W06000022     Newport

[53578 rows x 6 columns]

In [4]:
inner_merged_total = pd.merge(workZone_df, WZ_LA_map, on=['WZ11CD'], how="left")
inner_merged_total
#inner_merged_total.shape

,WZ11CD,Supergroup Code,Supergroup Name,Group Code,Group Name,FID,MSOA11CD,MSOA11NM,LAD20CD,LAD20NM
0,E33000001,E,Manufacturing and distribution,E4,"Manufacturing, energy and utilities",42579.0,E02006841,Gateshead 027,E08000037,Gateshead
1,E33000002,G,Servants of society,G3,Large scale education,42580.0,E02006841,Gateshead 027,E08000037,Gateshead
2,E33000003,E,Manufacturing and distribution,E1,Mining and quarrying facilities,42581.0,E02006841,Gateshead 027,E08000037,Gateshead
3,E33000004,E,Manufacturing and distribution,E1,Mining and quarrying facilities,42582.0,E02006841,Gateshead 027,E08000037,Gateshead
4,E33000005,G,Servants of society,G1,Public administration and security,42583.0,E02006841,Gateshead 027,E08000037,Gateshead
...,...,...,...,...,...,...,...,...,...,...
60704,W35002706,C,Metro suburbs,C5,Professional home-workers in outer suburbs,52445.0,W02000423,Cardiff 049,W06000015,Cardiff
60705,W35002707,G,Servants of society,G1,Public administration and security,52446.0,W02000423,Cardiff 049,W06000015,Cardiff
60706,W35002708,G,Servants of society,G1,Public administration and security,52447.0,W02000423,Cardiff 049,W06000015,Cardiff
60707,W35002709,C,Metro suburbs,C3,Metro suburban distribution industries,52448.0,W02000423,Cardiff 049,W06000015,Cardiff
60708,W35002710,C,Metro suburbs,C1,Teachers and carers in metro suburbs,52449.0,W02000423,Cardiff 049,W06000015,Cardiff

In [64]:
inner_merged_total = inner_merged_total[inner_merged_total['WZ11CD'].str.contains("E")]
#inner_merged_total = inner_merged_total.drop_duplicates(subset=['Group Code', 'LAD20CD'])
counts = inner_merged_total.groupby("LAD20NM")['Group Name'].sum()
counts

LAD20NM
Adur            Manufacturing, energy and utilitiesBusiness pa...
Allerdale       Market squaresLarge scale educationMining and ...
Amber Valley    Traditional high streetsLarge scale educationL...
Arun            Market squaresRural with mining or quarryingLo...
Ashfield        Low density wholesale and retailMultiethnic ur...
                                      ...
Worthing        Manufacturing, energy and utilitiesMining and ...
Wychavon        Public administration and securityTraditional ...
Wyre            Mining and quarrying facilitiesManufacturing, ...
Wyre Forest     Manufacturing, energy and utilitiesLow density...
York            Public administration and securityTown fringe ...
Name: Group Name, Length: 314, dtype: object

In [63]:
counts.reset_index().to_csv('data/class.csv', index=False)

# Urban / Rural

In [5]:
urbanRural_LA = pd.read_csv("data/RUC11_LAD11_ENv2.csv")
urbanRural_LA

,LAD11CD,LAD11NM,RUC11CD,RUC11,Rural population1,Hub towns (rural related) population1,Rural including hub towns (rural & rural related) population1,Total population1,Rural including hub towns (rural & rural related) population1
0,E06000001,Hartlepool,4,Urban with City and Town,"3,173",0,"3,173","92,028",3.4
1,E06000002,Middlesbrough,4,Urban with City and Town,957,0,957,"138,412",0.7
2,E06000003,Redcar and Cleveland,3,Urban with Significant Rural (rural including ...,"43,880",0,"43,880","135,177",32.5
3,E06000004,Stockton-on-Tees,4,Urban with City and Town,"7,536",0,"7,536","191,610",3.9
4,E06000005,Darlington,4,Urban with City and Town,"13,201",0,"13,201","105,564",12.5
...,...,...,...,...,...,...,...,...,...
321,E09000029,Sutton,6,Urban with Major Conurbation,0,0,0,"190,146",0.0
322,E09000030,Tower Hamlets,6,Urban with Major Conurbation,0,0,0,"254,096",0.0
323,E09000031,Waltham Forest,6,Urban with Major Conurbation,0,0,0,"258,249",0.0
324,E09000032,Wandsworth,6,Urban with Major Conurbation,0,0,0,"306,995",0.0
325,E09000033,Westminster,6,Urban with Major Conurbation,0,0,0,"219,396",0.0